In [1]:
import pandas as pd

In [3]:
import numpy as np
n = np.array([1,2,3,4,5])

In [4]:
n

array([1, 2, 3, 4, 5])

In [7]:
x = pd.Series([n])

In [8]:
x

0    [1, 2, 3, 4, 5]
dtype: object

In [9]:
type(x)

pandas.core.series.Series

In [11]:
b = pd.Series([1,2,[11,10],33,[12,23],47,58,100])

In [12]:
b

0           1
1           2
2    [11, 10]
3          33
4    [12, 23]
5          47
6          58
7         100
dtype: object

In [15]:
b[0]

1

In [16]:
b[0:3]

0           1
1           2
2    [11, 10]
dtype: object

In [17]:
b[3:7]

3          33
4    [12, 23]
5          47
6          58
dtype: object

In [19]:
b[7]

100

In [21]:
d = pd.Series({'a':10,'b':20,'c':30,'d':40})

In [22]:
d

a    10
b    20
c    30
d    40
dtype: int64

In [23]:
d['d']

40

In [24]:
d['b':]

b    20
c    30
d    40
dtype: int64

In [25]:
s = pd.Series([12,52,42,10,23],index=['q','w','e','r','t',])

In [26]:
s

q    12
w    52
e    42
r    10
t    23
dtype: int64

In [27]:
r = pd.Series([12,52,42,10,23],index=['SELFISH','BOUNCER','TOXIC','PALTU','POORNIMA',])

In [28]:
r

SELFISH     12
BOUNCER     52
TOXIC       42
PALTU       10
POORNIMA    23
dtype: int64

In [33]:
s1 = pd.Series([12,52,42,10,23],index=list('qwert'))

In [34]:
s1

q    12
w    52
e    42
r    10
t    23
dtype: int64

In [37]:
s2 = pd.Series([12,52,42,10,23,12,52,23,10,42,52,42])

In [38]:
s2

0     12
1     52
2     42
3     10
4     23
5     12
6     52
7     23
8     10
9     42
10    52
11    42
dtype: int64

In [39]:
s2.value_counts()

52    3
42    3
12    2
10    2
23    2
dtype: int64

In [44]:
s2.argmax()

1

In [45]:
s2.argmin()

3

In [48]:
s2 = pd.Series([12,52,42,10,23,12,52,23,10,42,52,42],index=list('qwertyiopasd'))

s2

In [49]:
s2

q    12
w    52
e    42
r    10
t    23
y    12
i    52
o    23
p    10
a    42
s    52
d    42
dtype: int64

In [50]:
s2 = pd.Series([12,52,42,10,23],index=list('qwert'))

In [51]:
s2

q    12
w    52
e    42
r    10
t    23
dtype: int64

In [52]:
s2.idxmax()

'w'

In [53]:
s2.idxmin()

'r'

# DATAFRAME

In [54]:
a = pd.DataFrame()
b = pd.DataFrame([1,2,55,40,86])

In [55]:
a

Empty DataFrame
Columns: []
Index: []

In [58]:
type(a)

pandas.core.frame.DataFrame

In [56]:
b

    0
0   1
1   2
2  55
3  40
4  86

In [57]:
type(b)

pandas.core.frame.DataFrame

In [59]:
c = pd.DataFrame([[1,2,3,4],[10,20,30,40],[100,200,300,400]])

In [60]:
c

     0    1    2    3
0    1    2    3    4
1   10   20   30   40
2  100  200  300  400

In [63]:
d = pd.DataFrame([[1,2,3,4,5],[10,20,30,40,50],[100,200,300,400,500],[6,7,8,9,10],[60,70,80,90,100]])

In [64]:
d

     0    1    2    3    4
0    1    2    3    4    5
1   10   20   30   40   50
2  100  200  300  400  500
3    6    7    8    9   10
4   60   70   80   90  100

In [69]:
#head() shows first 5 rows and columns
d.head()

     0    1    2    3    4
0    1    2    3    4    5
1   10   20   30   40   50
2  100  200  300  400  500
3    6    7    8    9   10
4   60   70   80   90  100

In [71]:
#tail() shows last 5 rows and columns
d.tail()

     0    1    2    3    4
0    1    2    3    4    5
1   10   20   30   40   50
2  100  200  300  400  500
3    6    7    8    9   10
4   60   70   80   90  100

In [74]:
# sample shows random values from your created dataframe
d.sample()

   0  1  2  3   4
3  6  7  8  9  10

In [75]:
d.sample(3)

     0    1    2    3    4
3    6    7    8    9   10
2  100  200  300  400  500
0    1    2    3    4    5

In [85]:
d = pd.DataFrame([[1,2,'Missing',4,5],[7,8,9],[10,np.nan,12,22]])

In [86]:
d

    0    1        2     3    4
0   1  2.0  Missing   4.0  5.0
1   7  8.0        9   NaN  NaN
2  10  NaN       12  22.0  NaN

In [89]:
d = pd.DataFrame([[1,2,'Missing',4,5],[7,8,9],[10,np.nan,12,22]],columns=['A','B','C','D','E'])

In [101]:
d = pd.DataFrame([[1,2,'Missing',4,5],[7,8,9],[10,np.nan,12,22],[3],['NONE',4]],columns=['colA','colB','colC','colD','colE'],index=['A','B','C','D','E'])

In [102]:
d

   colA  colB     colC  colD  colE
A     1   2.0  Missing   4.0   5.0
B     7   8.0        9   NaN   NaN
C    10   NaN       12  22.0   NaN
D     3   NaN     None   NaN   NaN
E  NONE   4.0     None   NaN   NaN

In [103]:
d.colB

A    2.0
B    8.0
C    NaN
D    NaN
E    4.0
Name: colB, dtype: float64

In [104]:
d[['colB','colC']]

   colB     colC
A   2.0  Missing
B   8.0        9
C   NaN       12
D   NaN     None
E   4.0     None

In [105]:
d[['colB','colC']][0:3]

   colB     colC
A   2.0  Missing
B   8.0        9
C   NaN       12

In [106]:
d[['colB','colC']][2:6]

   colB  colC
C   NaN    12
D   NaN  None
E   4.0  None

In [107]:
d[['colB','colC']].head()

   colB     colC
A   2.0  Missing
B   8.0        9
C   NaN       12
D   NaN     None
E   4.0     None

In [110]:
d[['colB','colC']].shape

(5, 2)

In [112]:
d.shape

(5, 5)

In [119]:
d

   colA  colB     colC  colD  colE
A     1   2.0  Missing   4.0   5.0
B     7   8.0        9   NaN   NaN
C    10   NaN       12  22.0   NaN
D     3   NaN     None   NaN   NaN
E  NONE   4.0     None   NaN   NaN

In [120]:
d['colB'].max()

8.0

In [126]:
d['new_col1'] = [12,24,36,48,60]

In [127]:
d

   colA  colB     colC  colD  colE  new_col  new_col1
A     1   2.0  Missing   4.0   5.0       12        12
B     7   8.0        9   NaN   NaN       24        24
C    10   NaN       12  22.0   NaN       36        36
D     3   NaN     None   NaN   NaN       48        48
E  NONE   4.0     None   NaN   NaN       60        60

In [130]:
d['new_col1'].max()

60

In [131]:
d['new_col1'].mean()

36.0

In [136]:
d['new_col2'] = [13,44,77,'none',55]

In [137]:
d

   colA  colB     colC  colD  colE  new_col  new_col1 new_col2
A     1   2.0  Missing   4.0   5.0       12        12       13
B     7   8.0        9   NaN   NaN       24        24       44
C    10   NaN       12  22.0   NaN       36        36       77
D     3   NaN     None   NaN   NaN       48        48     none
E  NONE   4.0     None   NaN   NaN       60        60       55

In [138]:
d['colD'] = d['new_col'] + d['new_col1']

In [139]:
d

   colA  colB     colC  colD  colE  new_col  new_col1 new_col2
A     1   2.0  Missing    24   5.0       12        12       13
B     7   8.0        9    48   NaN       24        24       44
C    10   NaN       12    72   NaN       36        36       77
D     3   NaN     None    96   NaN       48        48     none
E  NONE   4.0     None   120   NaN       60        60       55

In [149]:
f = d['colD']>50

In [151]:
d[f]

   colA  colB  colC  colD  colE  new_col  new_col1 new_col2
C    10   NaN    12    72   NaN       36        36       77
D     3   NaN  None    96   NaN       48        48     none
E  NONE   4.0  None   120   NaN       60        60       55